Final_Case/Refined_Grid/Laminar/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                           |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox     |
|  \\    /   O peration     | Version:  v1912                           |
|   \\  /    A nd           | Website:  www.openfoam.com                |
|    \\/     M anipulation  |                                           |
\*---------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4; // This is the number of cores you want to use

method          simple;

coeffs
{
    n           (4 1 1);  // How you want to devide the grid
}

distributed     no;

// ******************************************************************* //

//decomposePar

//mpirun -np 4 simpleFoam -parallel > logfile &

//reconstructPar